---
kind: method
id: M:Autodesk.Revit.DB.ChangeType.IsIdentical(Autodesk.Revit.DB.ChangeType)
source: html/0fd48bbf-4e2b-08a3-ec6c-95f921673fa1.htm
---
# Autodesk.Revit.DB.ChangeType.IsIdentical Method

Compares if two ChangeTypes are identical

## Syntax (C#)
```csharp
public bool IsIdentical(
	ChangeType changeType
)
```

## Parameters
- **changeType** (`Autodesk.Revit.DB.ChangeType`) - Input ChangeType to be compared

## Returns
True if the this ChangeType and input ChangeType are identical

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null